#+TITLE: Gptel Shell Command Tools
#+PROPERTY: header-args:emacs-lisp :tangle gptel-shell-command-tools.el 

#+begin_src emacs-lisp
(require 'json)

;; Configuration for async shell commands
(defcustom gptel-shell-command-timeout 300
  "Maximum execution time for shell commands in seconds."
  :type 'integer
  :group 'gptel)
#+end_src

#+RESULTS:
: gptel-shell-command-timeout

#+begin_src emacs-lisp
;; Manual cancellation command
(defun gptel-cancel-running-command ()
  "Cancel currently running shell command."
  (interactive)
  (let ((cancelled-any nil))
    (dolist (buffer (buffer-list))
      (with-current-buffer buffer
        (when (and (boundp 'gptel-running-process)
                   gptel-running-process
                   (process-live-p gptel-running-process))
          (kill-process gptel-running-process)
          (setq cancelled-any t)
          (message "Cancelled shell command: %s" 
                   (or (and (boundp 'gptel-command) gptel-command) "unknown")))))
    (unless cancelled-any
      (message "No running shell commands found"))))
#+end_src

#+RESULTS:
: gptel-cancel-running-command

#+begin_src emacs-lisp
(defun gptel-shell--handle-rejection (callback command user-feedback)
  "Handle user rejection of shell command execution."
  (let ((rejection-details `(("rejection_reason" . "user_declined")
                           ("command_preview" . ,command))))
    ;; Add user feedback if provided
    (when user-feedback
      (push `("user_feedback" . ,user-feedback) rejection-details))
    (funcall callback
      (json-encode 
`(("success" . nil)
                    ("exit_code" . -1)
                    ("output" . "")
                    ("message" . ,(if user-feedback
                                      (format "Command execution declined by user: %s" user-feedback)
                                    "Command execution declined by user"))
                    ("rejection_info" . ,rejection-details))))))
#+end_src

#+RESULTS:
: gptel-shell--handle-rejection

#+begin_src emacs-lisp
(defun gptel-shell--create-output-buffer (command)
  "Create and setup output buffer for shell command execution."
  (let* ((buffer-name (format "*GPTel Shell Command: %s*" 
                             (format-time-string "%H:%M:%S")))
         (output-buffer (generate-new-buffer buffer-name)))
    ;; Display output buffer immediately for visibility
    (display-buffer output-buffer)
    output-buffer))
#+end_src

#+RESULTS:
: gptel-shell--create-output-buffer

#+begin_src emacs-lisp
(defun gptel-shell--setup-process-metadata (output-buffer process command callback)
  "Store process metadata and callback in output buffer for tracking."
  (with-current-buffer output-buffer
    (setq-local gptel-running-process process)
    (setq-local gptel-command command)
    (setq-local gptel-start-time (current-time))
    (setq-local gptel-callback callback)))  ; Store callback in buffer
#+end_src

#+RESULTS:
: gptel-shell--setup-process-metadata

#+begin_src emacs-lisp
(defun gptel-shell--cleanup-buffer (output-buffer delay)
  "Clean up output buffer after specified delay in seconds."
  (run-with-timer delay nil 
    (lambda () 
      (when (buffer-live-p output-buffer)
        (kill-buffer output-buffer)))))
#+end_src

#+RESULTS:
: gptel-shell--cleanup-buffer

#+begin_src emacs-lisp
(defun gptel-shell--process-sentinel (callback)
  "Create process sentinel function for handling command completion."
  (lambda (proc event)
    (let ((output-buf (process-buffer proc)))
      (cond
       ((string-match "finished" event)
        ;; Successful completion
        (let ((exit-code (process-exit-status proc))
              (output (with-current-buffer output-buf
                       (buffer-string))))
          (funcall callback
            (json-encode `(("exit_code" . ,exit-code)
                          ("output" . ,output))))
          (gptel-shell--cleanup-buffer output-buf 5)))
       
       ((string-match "exited abnormally\\|killed\\|terminated" event)
        ;; Process failure or cancellation
        (let ((exit-code (process-exit-status proc))
              (output (with-current-buffer output-buf
                       (buffer-string))))
          (funcall callback
            (json-encode `(("exit_code" . ,exit-code)
                          ("output" . ,output)
                          ("error" . ,(format "Process %s" (string-trim event))))))
          (gptel-shell--cleanup-buffer output-buf 5)))
       
       (t
        ;; Unexpected termination
        (funcall callback
          (json-encode `(("exit_code" . -1
)
                        ("output" . "")
                        ("error" . ,(format "Unexpected process event: %s" event)))))
        (gptel-shell--cleanup-buffer output-buf 5))))))
#+end_src

#+RESULTS:
: gptel-shell--process-sentinel

#+begin_src emacs-lisp
(defun gptel-shell--setup-timeout (process output-buffer)
  "Setup timeout mechanism for shell command process."
  (run-with-timer gptel-shell-command-timeout nil
    (lambda () 
      (when (and (process-live-p process)
                 (buffer-live-p output-buffer))
        (kill-process process)
        (with-current-buffer output-buffer
          (when (boundp 'gptel-callback)
            (funcall gptel-callback 
              (json-encode `(("exit_code" . -1)
                            ("output" . "Command timed out")
                            ("error" . "timeout"))))))))))
#+end_src

#+RESULTS:
: gptel-shell--setup-timeout

#+begin_src emacs-lisp
(defun gptel-shell--get-tail-output (buffer max-lines)
  "Get the last MAX-LINES from BUFFER, with truncation notice if needed."
  (with-current-buffer buffer
    (let* ((full-output (buffer-string))
           (lines (split-string full-output "\n" t))  ; t to omit empty lines
           (line-count (length lines)))
      (if (<= line-count max-lines)
          full-output
        (let ((tail-lines (nthcdr (- line-count max-lines) lines)))
          (concat (format "... [output truncated, showing last %d lines] ...\n" max-lines)
                  (string-join tail-lines "\n")))))))
#+end_src

#+RESULTS:
: gptel-shell--get-tail-output

#+begin_src emacs-lisp
(defun my/gptel-run-shell-command-async (callback command purpose)
  "Async version: CALLBACK receives JSON result when command completes."
  (let* ((preview-result (gptel-shell-command--preview-and-confirm command purpose))
         (confirmed (car preview-result))
         (user-feedback (cdr preview-result)))
    (if (not confirmed)
        (gptel-shell--handle-rejection callback command user-feedback)
      (let* ((output-buffer (gptel-shell--create-output-buffer command))
             (process (start-process-shell-command 
                      "gptel-shell" output-buffer command)))
        (gptel-shell--setup-process-metadata output-buffer process command callback)
        (gptel-shell--setup-timeout process output-buffer)
        (set-process-sentinel process
          (lambda (proc event)
            (let ((output-buf (process-buffer proc)))
              (when (buffer-live-p output-buf)
                (with-current-buffer output-buf
                  (when (boundp 'gptel-callback)
                    (let ((cb gptel-callback))
                      (cond
                       ((string-match "finished" event)
                        (let ((exit-code (process-exit-status proc))
                              (output (gptel-shell--get-tail-output output-buf 50)))
                          (funcall cb
                            (json-encode `(("exit_code" . ,exit-code)
                                          ("output" . ,output))))
                          (gptel-shell--cleanup-buffer output-buf 5)))
                       ((string-match "exited abnormally\\|killed\\|terminated" event)
                        (let ((exit-code (process-exit-status proc))
                              (output (gptel-shell--get-tail-output output-buf 50)))
                          (funcall cb
                            (json-encode `(("exit_code" . ,exit-code)
                                          ("output" . ,output)
                                          ("error" . ,(format "Process %s" (string-trim event))))))
                          (gptel-shell--cleanup-buffer output-buf 5)))
                       (t
                        (let ((output (gptel-shell--get-tail-output output-buf 50)))
                          (funcall cb
                            (json-encode `(("exit_code" . -1)
                                          ("output" . ,output)
                                          ("error" . ,(format "Unexpected process event: %s" event)))))
                          (gptel-shell--cleanup-buffer output-buf 5)))))))))))))))
#+end_src

#+RESULTS:
: my/gptel-run-shell-command-async

#+begin_src emacs-lisp
  ;; Keep original synchronous function as backup
  (defun my/gptel-run-shell-command (command purpose)
    "Run COMMAND in the shell with PURPOSE explanation and return a JSON string with `exit_code` and `output`."
    ;; Step 1: Preview command and get user confirmation
    (let* ((preview-result (gptel-shell-command--preview-and-confirm command purpose))
           (confirmed (car preview-result))
           (user-feedback (cdr preview-result)))
      (if (not confirmed)
          ;; User declined - return failure with feedback info
          (let ((rejection-details `(("rejection_reason" . "user_declined")
                                   ("command_preview" . ,command))))
            ;; Add user feedback if provided
            (when user-feedback
              (push `("user_feedback" . ,user-feedback) rejection-details))
            (json-encode `(("success" . nil)
                          ("exit_code" . -1)
                          ("output" . "")
                          ("message" . ,(if user-feedback
                                            (format "Command execution declined by user: %s" user-feedback)
                                          "Command execution declined by user"))
                          ("rejection_info" . ,rejection-details))))
        ;; Step 2: Execute the command
        (let* ((buffer (generate-new-buffer " *gptel-shell-output*"))
               (exit-code (call-process-shell-command command nil buffer t))
               (output
                (with-current-buffer buffer
                  (prog1
                      (buffer-string)
                    (kill-buffer)))))
          (json-encode `(("exit_code" . ,exit-code)
                        ("output"    . ,output)))))))
#+end_src

#+RESULTS:
: my/gptel-run-shell-command

#+begin_src emacs-lisp
(defun gptel-shell-command--preview-and-confirm (command purpose)
  "Show shell command preview and get user confirmation.
Returns cons cell (CONFIRMED . FEEDBACK) where:
- CONFIRMED: t if user confirms, nil if user declines  
- FEEDBACK: user feedback string if rejected and feedback collected, nil otherwise"
  (let ((confirmed
         ;; Display command preview in a temporary buffer
         (let ((preview-buffer (get-buffer-create "*GPTel Shell Command Preview*")))
           (with-current-buffer preview-buffer
             (erase-buffer)
             (insert "GPTel wants to execute shell command:\n\n")
             (insert (format "Purpose: %s\n\n" purpose))
             (insert "Command to be executed:\n")
             (insert "=====================\n\n")
             (insert command)
             (insert "\n\n")
             (insert "⚠️  WARNING: This command will have full access to your system!\n")
             (insert "Only proceed if you trust and understand this command.\n\n")
             (shell-script-mode)
             (goto-char (point-min)))
           ;; Show the preview buffer
           (display-buffer preview-buffer)
           ;; Get user confirmation
           (let ((response (y-or-n-p "Execute this shell command? ")))
             ;; Clean up preview buffer
             (kill-buffer preview-buffer)
             response))))
    ;; If user declined, collect feedback
    (if confirmed
        (cons confirmed nil)
      (let ((feedback (gptel-shell-command--collect-rejection-feedback command)))
        (cons confirmed feedback)))))

(defun gptel-shell-command--collect-rejection-feedback (command)
  "Collect user feedback about why they rejected the shell command execution.
Returns feedback string or nil if user skips feedback."
  (let* ((prompt "Why did you reject this shell command execution? (Enter for skip): ")
         (feedback (read-string prompt)))
    (if (string-empty-p feedback)
        nil
      feedback)))
#+end_src

#+RESULTS:
: gptel-shell-command--collect-rejection-feedback

#+begin_src emacs-lisp
(gptel-make-tool
 :name        "shell_command"
 :function    #'my/gptel-run-shell-command-async
 :description "Run an arbitrary shell COMMAND and return JSON with exit_code and output."
 :async       t                         ; CRITICAL: Enable async mode
 :include     t
 :args        '((:name "command"
		 :type string
		 :description "The shell command to execute (as you would type it in a terminal)")
                (:name "purpose"
                 :type string
                 :description "Required explanation of why this shell command execution is being performed"))
 :category    "system")
#+end_src

#+RESULTS:
: #s(gptel-tool my/gptel-run-shell-command-async "shell_command" "Run an arbitrary shell COMMAND and return JSON with exit_code and output." ((:name "command" :type "string" :description "The shell command to execute (as you would type it in a terminal)") (:name "purpose" :type "string" :description "Required explanation of why this shell command execution is being performed")) t "system" nil t)

#+begin_src emacs-lisp
(register-gptel-tool "shell_command")
#+end_src

#+RESULTS:
| #s(gptel-tool my/gptel-run-shell-command-async shell_command Run an arbitrary shell COMMAND and return JSON with exit_code and output. ((:name command :type string :description The shell command to execute (as you would type it in a terminal)) (:name purpose :type string :description Required explanation of why this shell command execution is being performed)) t system nil t) | #s(gptel-tool my/gptel-execute-elisp execute_elisp Execute arbitrary elisp code in the current Emacs process and return the result. |






